#ifndef CONSOLE_H
#define CONSOLE_H

#include "graphics.h"

// 画面コンソール (ターミナル) の状態管理構造体
typedef struct {
  FrameBuffer *fb;        // 出力先のフレームバッファ
  unsigned int cursor_x;  // 現在の文字カーソルのX座標 (px)
  unsigned int cursor_y;  // 現在の文字カーソルのY座標 (px)
  unsigned int fg_color;  // 文字色 (32-bit RGB: 0x00RRGGBB)
  unsigned int bg_color;  // 背景色 (32-bit RGB: 0x00RRGGBB)
} Console;

// ============================================================================
// console_init: コンソールを初期化する
// ============================================================================
// - 引数1 (con):         初期化対象となるコンソール構造体へのポインタ
// - 引数2 (fb):          出力先となるフレームバッファ情報へのポインタ
// - 引数3 (fg_color):    文字色 (32-bit RGB: 0x00RRGGBB) 
// - 引数4 (bg_color):    背景色 (32-bit RGB: 0x00RRGGBB)
void console_init(Console *con, FrameBuffer *fb, unsigned int fg_color, unsigned int bg_color);

// ============================================================================
// console_putc: コンソールに 1 文字を出力する 
//               (改行・自動折返し・スクロール処理を含む)
// ============================================================================
// - 引数1 (con):  出力先コンソール構造体へのポインタ
// - 引数2 (str):   出力する文字 (ASCIIコード)
void console_putc(Console *con, char c);

// ============================================================================
// console_puts: コンソールに NULL 終端文字列を出力する
// ============================================================================
// - 引数1 (con):  出力先コンソール構造体へのポインタ
// - 引数2 (str):   出力する文字 (ASCIIコード)
void console_puts(Console *con, const char *str);

// ============================================================================
// console_scroll: 画面全体を 1 行分 (16 ピクセル) 上にスクロールする
// ============================================================================
// - 引数1 (con):  スクロール対象のコンソール構造体へのポインタ
void console_scroll(Console *con);

#endif
